# -*- coding: utf-8 -*-
"""
Завдання 4.1

Конвертувати рядок в змінній mac з формату XXXX:XXXX:XXXX у формат
XXXX.XXXX.XXXX (замінити : на .) Отриманий новий рядок вивести на стандартний
потік виводу (stdout) за допомогою print.

Попередження: у розділі 4 тести можна легко "обдурити", зробивши потрібний
вивід print, без отримання результатів з даних завдання за допомогою Python. Це
не означає, що завдання зроблено правильно, просто на даному етапі складно
інакше перевіряти результат.
"""

mac = "AAAA:BBBB:CCCC"

res_mac = ""


result = 0

for i in range(0, len(mac), 4):
   res_mac = res_mac + mac[i:i+4] 
   
res_mac = res_mac.replace(":", ".")
print(res_mac)